{
  "home": {
    "description": "Bates Propulsion Labs is a small group of engineers working on a variety of different propulsion systems and launch vehicles. We are sharing our progress with the world to help inspire others to build their own rocketry projects."
  },
  "poc1": {
    "engineSpecs": [
      {
        "title": "Chamber Pressure",
        "spec": "300 PSI"
      },
      {
        "title": "Fuel",
        "spec": "Liquid Kerosene"
      },
      {
        "title": "Oxidizer",
        "spec": "Gaseous Oxygen"
      },
      {
        "title": "O/F",
        "spec": "2.31"
      },
      {
        "title": "Total Flow Rate",
        "spec": "0.95 lbm/s"
      },
      {
        "title": "Vehicle",
        "spec": "Test Stand Only"
      }
    ],
    "summary": "The POC-1 was built as a test engine to gain experience designing, building and operating a rocket propulsion system. This engine is not intended to fly as it uses a water cooling system. The cooling system is design as a regen system, but the flow rates required exceed that of the fuel system necessitating and external coolant supply.",
    "engineAssembly": {
      "summary": "POC-1's primary design philosophies were cost and simplicity of manufacturing. Coming up with the initial geometry of the engine based on some specs with software like RPA is pretty easy, then you have to figure out how to make it. A combustion chamber is an inherently difficult to machine part. It usually requires a CNC lathe with considerable bore depths. We ordered our chamber from Proto Labs and it was made in China and came back with a very rough surface on converging nozzle, This required significant man hours to polish out otherwise we would have experienced flow losses and greater heat transfer at the throat.",
      "combustionChamber": "Our combustion chamber and our injector were made from low carbon 1018 steel for weldability, ease of machine and cost.",
      "warmFire": "After we had the injector assembled, the combustion chamber and the coolant jacket were still very long lead time items so we decided to perform a \"Warm Fire\" with as fuel only injector to test it out along with our test stand, it primarily acted as schedule driver to get hardware, software and electric in functional shape. After warm fire we decided to completely rebuild the electrical system and we learned a lot about the stand and the logistics of getting the massive stand to the test site.",
      "postWarmFire": "After warm fire we attempted some quick turn combustion chamber ideas while waiting for the real chamber explored here if you want to learn ways NOT to make a combustion chamber: ",
      "waterJacket1": "One of the trickiest parts of small scale rocket engine development is the regen cooling system. If making a combustion chamber wasn't hard enough now you have to get a pressure vessel around that. That requires something that either splits with a weld or bolts with a fancy sealing mechanism or have it slide into a bore with an insert in the throat region.",
      "waterJacket2": "We went with a straight bore and insert method. The main jacket is aluminum with a deep straight bore, the part doesn't seem too complex but the long bore non-trivial to turn on a lathe.",
      "coolingInsert": "For our cooling insert due to the complex geometry we used a SLA printed Nylon we got discounted from GoProto. This made it far cheaper than going with a machined part and works well since the part is low load and isn't in too high of a temperature environment. The parts used brass inserts installed with a soldering iron mounted to a drill press and laser cut gasket.",
      "edmFilmCoolingOrifices": "In-order for the throat not to melt regen cooled engines gernally require film cooling just upstream of the throat. This requires injecting fuel/coolant from the regen system into the chamber at a known flow rate. If too much is injected it won't get combusted and will lower ISP, too little and the engine melts. We optimally would have had 0.010\" holes but the smallest we could get were 8x 0.015\" holes. To make holes this small especially at crazy angles usually requires EDM. We used Applegate EDM and it cost us $500 for the 8 holes (more than we paid for the chamber it's self).",
      "postStaticFire": "WWII era relic recovery (i.e. Post static fire + 1 month marinade inspection)"
    },
    "daq": {
      "hardware": "We initially started with an Arduino to control our stand and quickly reached its limits and moved to an ARM board. This allowed us to have dedicated much higher precision  ADC (analog-to-digital) converter. To achieve a 1khz data rate on all our sensors with 12 bit values ended up being pretty challenging, I wouldn't recommend it without a strong electrical engineer on the team. It's an order of magnitude more challenging than an Arduino project like the vertical integrator avionics.",
      "groundStation": "If you want a high data rate, don't make a GUI in MATLAB it's far too slow. At 1kHz data rate the serial read method takes half the cycle time."
    }
  }
}