{
  "home": {
    "description": "Bates Propulsion Labs is a small group of engineers working on a variety of different propulsion systems and launch vehicles. We are sharing our progress with the world to help inspire others to build their own rocketry projects."
  },
  "poc1": {
    "engineSpecs": [
      {
        "title": "Chamber Pressure",
        "spec": "300 PSI"
      },
      {
        "title": "Fuel",
        "spec": "Liquid Kerosene"
      },
      {
        "title": "Oxidizer",
        "spec": "Gaseous Oxygen"
      },
      {
        "title": "O/F",
        "spec": "2.31"
      },
      {
        "title": "Total Flow Rate",
        "spec": "0.95 lbm/s"
      },
      {
        "title": "Vehicle",
        "spec": "Test Stand Only"
      }
    ],
    "summary": "The POC-1 was built as a test engine to gain experience designing, building and operating a rocket propulsion system. This engine is not intended to fly as it uses a water cooling system. The cooling system is design as a regen system, but the flow rates required exceed that of the fuel system necessitating and external coolant supply.",
    "engineAssembly": {
      "summary": "POC-1's primary design philosophies were cost and simplicity of manufacturing. Coming up with the initial geometry of the engine based on some specs with software like RPA is pretty easy, then you have to figure out how to make it. A combustion chamber is an inherently difficult to machine part. It usually requires a CNC lathe with considerable bore depths. We ordered our chamber from Proto Labs and it was made in China and came back with a very rough surface on converging nozzle, This required significant man hours to polish out otherwise we would have experienced flow losses and greater heat transfer at the throat.",
      "combustionChamber": "Our combustion chamber and our injector were made from low carbon 1018 steel for weldability, ease of machine and cost.",
      "warmFire": "After we had the injector assembled, the combustion chamber and the coolant jacket were still very long lead time items so we decided to perform a \"Warm Fire\" with as fuel only injector to test it out along with our test stand, it primarily acted as schedule driver to get hardware, software and electric in functional shape. After warm fire we decided to completely rebuild the electrical system and we learned a lot about the stand and the logistics of getting the massive stand to the test site.",
      "postWarmFire": "After warm fire we attempted some quick turn combustion chamber ideas while waiting for the real chamber explored here if you want to learn ways NOT to make a combustion chamber: ",
      "waterJacket1": "One of the trickiest parts of small scale rocket engine development is the regen cooling system. If making a combustion chamber wasn't hard enough now you have to get a pressure vessel around that. That requires something that either splits with a weld or bolts with a fancy sealing mechanism or have it slide into a bore with an insert in the throat region.",
      "waterJacket2": "We went with a straight bore and insert method. The main jacket is aluminum with a deep straight bore, the part doesn't seem too complex but the long bore non-trivial to turn on a lathe.",
      "coolingInsert": "For our cooling insert due to the complex geometry we used a SLA printed Nylon we got discounted from GoProto. This made it far cheaper than going with a machined part and works well since the part is low load and isn't in too high of a temperature environment. The parts used brass inserts installed with a soldering iron mounted to a drill press and laser cut gasket.",
      "edmFilmCoolingOrifices": "In-order for the throat not to melt regen cooled engines gernally require film cooling just upstream of the throat. This requires injecting fuel/coolant from the regen system into the chamber at a known flow rate. If too much is injected it won't get combusted and will lower ISP, too little and the engine melts. We optimally would have had 0.010\" holes but the smallest we could get were 8x 0.015\" holes. To make holes this small especially at crazy angles usually requires EDM. We used Applegate EDM and it cost us $500 for the 8 holes (more than we paid for the chamber it's self).",
      "postStaticFire": "WWII era relic recovery (i.e. Post static fire + 1 month marinade inspection)"
    },
    "daq": {
      "hardware": "We initially started with an Arduino to control our stand and quickly reached its limits and moved to an ARM board. This allowed us to have dedicated much higher precision  ADC (analog-to-digital) converter. To achieve a 1khz data rate on all our sensors with 12 bit values ended up being pretty challenging, I wouldn't recommend it without a strong electrical engineer on the team. It's an order of magnitude more challenging than an Arduino project like the vertical integrator avionics.",
      "groundStation": "If you want a high data rate, don't make a GUI in MATLAB it's far too slow. At 1kHz data rate the serial read method takes half the cycle time."
    },
    "pneumaticValves": {
      "designIntent": [
        "Control flow of propellants from tanks to the engine",
        "Withstand 500 psi",
        "Proper Cv to maintain flowrates",
        "Works well with gaseous oxygen and kerosene"
      ],
      "earlyDevelopment": "We needed to pick a valve that would perform well with gaseous oxygen and withstand pressures above 500 psi for safety. The valve we chose was a spring return ball valve rated to 600 psi with a flow coefficient (cv) of 6.5. This valve also had PTFE seals that do not react with oxygen. We chose a valve with a cv that would allow proper flow rates throughout the system. We calculated the cv for kerosene and gaseous oxygen with the assumption that kerosene was incompressible and gaseous oxygen was compressible. Considering these valve did not need to be throttled, selecting a valve with a cv that was slightly larger than the calculated cv was not an issue. An orifice adapter could easily be attached to the valve to reduce flowrate as needed. As for the pneumatic cylinder, initially we used a single-acting pneumatic cylinder with a 4\" stroke we had on hand. Through testing, we found this pneumatic cylinder was too short and created some safety issues in that the cylinder return was only actuated with a spring instead of compressed air. Considering we did have a spring return valve, the valve spring would work along with the spring in the pneumatic cylinder, but the issue of binding between the valve handle and stroke was a concern. We decided to use a double acting pneumatic cylinder with a 5\" stroke. This type of pneumatic cylinder would ensure the valve would close if the spring on the valve was not strong enough to counter the fluid flowing through the valve. The next step was connecting the valve to the pneumatic cylinder.",
      "design1": "The first  design involved the same valve and pneumatic cylinder, with the addition of a bracket and ball joint rod end. The hopes of this design were that when the pneumatic cylinder tried to close the valve, the rod and valve handle would not bind. We 3D printed a bracket with two holes, one for a bearing, and another to connect to the rod end. We also used a drill press to make a hole through the valve handle where the bracket bolt connects to. This was not the simplest design, and there was an issue of the rod end hitting the bolt on the bracket when closing the valve. Although the valve would consistently  close, it took too long to install which hindered testing.",
      "design2": {
        "summary": "The second design was the simplest design. This design used a spring return ball valve, pneumatic cylinder, and a ball joint rod end. The initial concern was the fact that when the pneumatic cylinder actuated to full length, it had to be positioned in a way they when it retracted, the stem wouldn't bind with the valve handle as it spring returned closed. Considering the pneumatic cylinder was double-acting, meaning the cylinder opened and closed with compressed air, this was not an issue. Therefore, if the spring could not close the valve on its' own, the pneumatic cylinder would close the valve the rest of the way.",
        "testing": "To determine the best design for this application, a series of tests were conducted for each design.",
        "afterTesting": "After testing, it was concluded that the first design was the most cost effective, compact, easy to assemble, and simple. The double-acting pneumatic cylinder a greater return force than expected, even at 30 psi, to close the valve without any stalling issues. It was also noted that the position of the pneumatic valve with relation to the valve handle was very important as to not pull the valve out of its' 3D printed mount which later on was not an issue once mounts were welded to the test stand."
      },
      "valveMounts": "After selecting the best actuation design for the valve, we designed mounts to secure the valves on the test stand. Initially, we 3D printed valve mounts that used the hex feature of the valve to prevent rotation and secure the valve in place. Unfortunately, as the technicians tried to torque fittings on the inlet and outlet of the valves, they would apply so much force on the mounts that they mount would break. This happened constantly.  The mounts were designed to hold the valve in place, not counteract torsional forces applied my tightening fittings. A new, more permanent mount design was implemented.",
      "valveMounts2": "Most of the mounts to secure the valves in place were still 3D printed, but we took advantage of the hex feature to create a mount that functioned as its own wrench. This allowed technicians to tighten fittings with one wrench instead of two. This also allowed for easy and quick installation of valves and their perspective fittings. Using the offsite plasma cutter, we cut out mounts with a hex feature from 1/4\" steel sheets. A few mounts had to be created before they fit the hex shape of the valve due to the inaccuracies of plasma cutting. Eventually, 6 mounts were cut and welded to the test stand. Welding these new mounts saved time and money since we no longer needed to drill 12 holes through steel or buy 12 bolts to secure the 3D printed mounts. The design of the mount became simple and could withstand the torsional forces applied to the valve when tightening fittings."
    },
    "throttleValves": {
      "designIntent": [
        "Create a valve mount and actuation system to throttle flow of propellants to engine",
        "Must withstand 500 psi",
        "Can be used with gaseous oxygen and kerosene"
      ]
    }
  },
  "kndx1": {
    "engineSpecs": [
      {
        "title": "Thrust",
        "spec": "~18 lbf"
      },
      {
        "title": "Fuel",
        "spec": "Dextrose"
      },
      {
        "title": "Oxidizer",
        "spec": "Potassium Nitrate"
      },
      {
        "title": "O/F",
        "spec": "1.85"
      },
      {
        "title": "Throat Diameter",
        "spec": "0.332"
      },
      {
        "title": "Vehicle",
        "spec": "Vertical Integrator"
      }
    ],
    "summary1": "This engine has its roots in practicing aluminum fuel tank welds, I had been welding some simple test vessels to hydro statically test and realized I could probably turn them into rocket engines. So I did a lot of reading on Richard Nakka's excellent rocket website ",
    "summary2": " and got to work designing my own solid rocket engine. I would not recommend using aluminum for an engine you want to fire many times. However, only having a small G0765 Grizzly 7\" x 14\" Mini lathe, steel turning was outside my capabilities. Aluminum is easy and fast to machine but will erode with multiple firings.",
    "staticFire1": "In this static fire the engine performed far lower than analytically predicted by {link}, and took far to long to come up to full thrust. We addressed this by incrasing the amount of black powder in the ignitor, adding slits to the side of the straw ignitor and hot gluing the throat of the engine. This allowed pressure to build in the chamber and combustion to spread before the ignitor was ejected.",
    "staticFire2": "The second static fire demonstrated much better ramp up time with the new ignitor. The exterior of the engine was also machined down for weight savings. Unfortunately the thrust tester was not zip tied to the test stand and thus no thrust curve was able to be generated with the new ignitor design, and the next test was the maiden flight of the Vertical Integrator.",
    "throatErosion": "As expected after multiple firings the aluminum throat started to erode. So while aluminum engines are easy to make they don't last many firings. This issues was likely exasperated by the step on the inside of the throat. Due to poor machining of the nozzle by the author instead of a the cones meeting at a smooth point, the converging nozzle hits a flat with a thin sharp wall to the expanding nozzle on the other side. This also explains the lower than expected performance.",
    "propellantManufacturing": {
      "summary": "We primarily followed the procedure outlined on Richard Nakka's site: ",
      "step1": "Dextrose was ground in the mortar pestle then baked for an hour in the oven at 175F for 1 hour to remove the water content.",
      "step2": "While Stump remover was run through a coarse sieve to remove chunks and then ground in mortar pestle.",
      "step3": "After baking the dextrose will form chunks and needs to be ground back to a powder with a mortar pestle.",
      "step4": "The ratios can then be confirmed, an extra 9% of dextrose needs to be put in the oven to account for the water being baked out. Final ratio should be 65% Potassium Nitrate and 35% Dextrose for optimal performance. This mix needs to be  thoroughly mixed, for this we used a protein shake bottle with mixer ball.",
      "step5": "We then heated a skillet to 135-145C on an electric stove, using a heat gun and constant tuning of the heat setting. Propellant was added steadily added as existing propellant melted stirring until all propellant was added and mixed. Unlike Nakka we were able to get a very pourable mixture.",
      "step6": "Propellant was poured into 3D printed molds. PLA was not a good choice for the center post as it softened and tilted as propellant was poured. It was later replaced with a partial threaded rod from McMaster. Due to the stickiness of the propellant and the roughness of 3D prints the upper section of the mold was simply removed with a hacksaw after the propellant was allowed to dry.",
      "step7": "Propellant is then ready to be loaded into the engine or stored in an air tight container.",
      "step8": "If there are issues with in fitting into the engine (such as too much penetration on the weld) we found an effective strategy to get the propellant is was to plug the nozzle with plastic wrap with a few layers then dunk in boiling water. The propellant can then easily be squeezed in.",
      "step9": "To aid combustion speed in our second batch we poured black powder through the center bore of the propellant grain."
    }
  },
  "verticalIntegrator": {
    "summary": "The vertical integrator was a build to rapidly develop a full stack rocket from scratch to gain competency and experience in flight vehicle design before scaling up to a bi-propellant liquid rocket. The rocket was designed and built in 3 weeks with no purchased off the shelf rocket parts. The engine and recovery was inspired by {link}, the avionics was optimized for ease of interfacing with minimal time spent in firmware development. The rocket was designed to be modular with mostly 3D printed components to allow rapid iteration and repair.",
    "designed": "The rocket was designed in SolidWorks with stability and trajectory analysis done in Open Rocket.",
    "flight1": "Flight #1 successfully demonstrated rocket stability, successful ignition and partial functionality of avionics. Recovery failed to deploy which is attributed to a yet un-discovered software bug and the incorrect manually recovery signal was sent (caps-lock caused the wrong P to be sent over serial, room for usability improvements here). Data logging while slow (from long barometer poll time) was functional, barometer seems to be thrown off by engine exhaust during ascent burn.",
    "recovery": {
      "summary": "For our parachute we went with a semi-ellipsoid design based off {link} with Dragon/Apollo capsule colors. The manufacturing is not complex, but is very time consuming in both hand stitching and machine stitching.",
      "inspired": "Parachute assembly photos, etc. inspired by Richard Nakka",
      "parachute": "With a single stage recovery system we had to trade between impact velocity and horizontal drift. The fins on this rocket were designed to be easily replaceable and thus we priorities minimizing horizontal drift of impact speeds to necessitate a smaller launch site.",
      "gores": "Gores were cut from rip stop nylon using printed flat patterns. The edges are hemmed and then sewed to a binding (not to the other gores) to allow for proper shape at deployment. The parachute is then connected to the rocket using braided Kevlar line.",
      "deployment": "The next challenge was deployment, we used a (home-brew) black powder charge of ground natural charcoal (not briquets with clay) and potassium nitrate loaded into a hot glue sealed straw. Embedded in the powder is a 38 AWG nichrome wire powered by a 9v on a relay circuit, we initially tried to get the 24 AWG nichrome used for lighting the liquid to work with a 9v, but it's doesn't have sufficient power output.",
      "gas": "With enough pressurized gas being generated by the black powder charge we needed a way to contain it an use it to force out the parachute. In initial testing we would fire the ignitor and a puff of smoke would come out, but no parachute. We determined that with 3D printer tolerances our plunger was able to spin in the bore and leak the gas out. It fix this we increased the L/D of the plunger and reduced the points of contact to just two ridges. This reduced friction while also making it easy print the ridges over sized and sand them to the desired fit."
    },
    "avionics": {
      "summary": "The primary goal of Vertical Integrators Avionics system was ease of programing. The IMU and altimeter purchased do all the math for you and are ease to read on I2C. This however comes at the expense of being very slow, the altimeter take 400 ms to poll in it's factory setup which with a simple Arduino loop severely limits your overall data rate. This can be solved by setting some registry bits or by changing the library methods, but this wasn't done before the first flight."
    }
  },
  "nitrousOxide": {
    "afterStaticFire1": "After static firing POC-1 with gaseous oxygen, the team wanted to move toward a more flight weight design. The first plan was to use hydrogen peroxide. Hydrogen peroxide on paper is an amazing propellant, you can take it from an easy mono propellant to respectable ISP with a little added fuel. However, sourcing the propellant affordably is quite challenging. FrontierAstronautics.com will sell you propellent grade HTP at $30 a pound, but when you consider the engine consumes over a pounds per second, long duration static fires quickly add up. Then you have to source a considerable amount of silver mesh as the catalyst. Distilling your own HTP seems like a good idea at first but is impractical at any reasonable scale and very dangerous. Many small labs have blown them selves up refining it and any one who has worked with it recommends against distilling your self.",
    "afterHydrogenPeroxide": "After realizing that hydrogen peroxide was going to impractical we looked at other storable oxidizers that would be easier to use than Lox. N2O is extremely easy to use and source, any race shop around can fill your tank and you can store it at room temperature. This storability and self pressurizing nature is what makes it so popular with hybrid rockets. The performance and effective density are obviously not as good as LOx due to the extra nitrogen you are lugging around. Regenerative cooling also becomes a challenge as your fuel flow rates are very low.",
    "co2": "Currently we are experimenting with CO2 as it has similar two-phase properties to N20 will being much cheaper, easy to source and less dangerous. We will use CO2 to test our venturi and validate our back flow chamber set up where we will attempt to keep the chamber pressure at 300 psi using a throttle valve."
  },
  "about": [
    {
      "name": "Eddie Bates",
      "title": "Chief Engineer/Founder",
      "industryJob": "Propulsion Components Engineer SpaceX",
      "bio": "After coming back to school from SpaceX I needed a project to fill my time and learn from, I felt like I'd learned most of what I could from FSAE so I set out to build my own rocket engine. I grew the project to include some other members and after the first static firing  we started working on some other propulsion/rocketry projects from a cryogenic propulsion system for our capstone to small scale solid rockets."
    },
    {
      "name": "Sam Aceves",
      "title": "System/Recovery/Ignitor/Valves",
      "contributions": [
        "POC-1 Pneumatics Valves",
        "POC-1 Throttle Valves",
        "Vertical Integrator - Recovery"
      ],
      "industryJob": "Raytheon Mechanical Engineering Intern",
      "bio": "While I was the payload team lead for IREC, I was asked to join Eddie's team to help design, manufacture, and test a rocket engine. Upon joining the team, I tried to get involved with multiple areas of the projects. I designed mounting and actuation structures for the valves on POC-1. I created a P&ID of the entire system for the cryogenic rocket engine. I gained hands on experience with rocket engine components and an understanding of  fluid flow through the system . I thrive in fast-paced, busy work environments and long to continue working with like-minded individuals who are passionate engineers. I hope to apply this knowledge and experience to future development of innovative technology for the aerospace and defense industry."
    },
    {
      "name": "Dhruv Goel",
      "title": "Electrical Lead",
      "industryJob": "Tinker Air Force Base Electrical Engineering Intern",
      "bio": "I met Eddie through the FSAE team at UTD. I was asked to join the team by Eddie just prior to the warm firing of POC-1 as the test stand needed an overhaul of its control system. During my time here I have redesigned the controls and data collection system for the test stand as well as designed flight versions of these systems with telemetry for integration into our present and future launch vehicles. I have also been working on propellant tank design, throttle valve assemblies, and recovery systems for the NOS rocket. My interests center around embedded systems, mixed signal processing, and RF/Radar design."
    },
    {
      "name": "Jacob Greenway",
      "title": "Web Designer",
      "industryJob": "Software Engineer Dell EMC",
      "bio": "I'm an old friend of Eddie's and try to help him on his many crazy projects when I get the chance to. I currently work for Dell EMC as an engineer on the PowerFlex (software defined storage) team. I'm a huge fan of anything aviation and engineering, so I enjoy checking out what's going on at Bates Propulsion Labs when I can. I'm mainly in the web development space by trade, but physical electronics and server hardware are a big hobby of mine as well."
    }
  ]
}